shuqee/shuqee_ltc/shuqee_ltc_stm32f107/shuqee_ltc/Src/modbus_udp.c
	switch (mcu_receive_read_info_id)
	{
		case 0:
			mcu_receive_read_info_len = sizeof(UUID) - 1;
			user_read_uuid(UUID);
		    mcu_receive_read_info_data = UUID;
			break;
		default :
			mcu_receive_read_info_len = 0;
			mcu_receive_read_info_data = NULL;
			break;
	}
	
	adu.id = id_reserve;
	len += sizeof(adu.id);
	adu.pdu.mbfuncode = funcode_pc_read_info;
	len += sizeof(adu.pdu.mbfuncode);
	adu.pdu.data.pc_read_info.id = mcu_receive_read_info_id;
	len += sizeof(adu.pdu.data.pc_read_info.id);
	adu.pdu.data.pc_read_info.len = mcu_receive_read_info_len;
	len += sizeof(adu.pdu.data.pc_read_info.len);
	memcpy(adu.pdu.data.pc_read_info.data, mcu_receive_read_info_data, mcu_receive_read_info_len);
	len += mcu_receive_read_info_len;
	adu.crc = crc16((uint8_t *)&adu, len);
	memcpy(send_buf, (uint8_t *)&adu, len);
	send_buf[len] = (uint8_t)(adu.crc);
	len += 1;
	send_buf[len] = (uint8_t)(adu.crc >> 8);
	len += 1;
	return len;
}
static uint16_t mcu_send_read_addr = 0;
static uint16_t mcu_send_read_len = 0;
uint16_t mb_req_mcu_read(uint8_t *send_buf)
{
	uint16_t len = 0;
	adu.id = id_reserve;
	len += sizeof(adu.id);
	adu.pdu.mbfuncode = funcode_mcu_read;
	len += sizeof(adu.pdu.mbfuncode);
	adu.pdu.data.mcu_read.addr = BigLittleSwap16(mcu_send_read_addr);
	len += sizeof(adu.pdu.data.mcu_read.addr);
	adu.pdu.data.mcu_read.len = BigLittleSwap16(mcu_send_read_len);
	len += sizeof(adu.pdu.data.mcu_read.len);
	adu.crc = crc16((uint8_t *)&adu, len);
	memcpy(send_buf, (uint8_t *)&adu, len);
	send_buf[len] = (uint8_t)(adu.crc);
	len += 1;
	send_buf[len] = (uint8_t)(adu.crc >> 8);
	len += 1;
	return len;
}
static uint16_t mcu_send_write_addr = 0;
static uint16_t mcu_send_write_len = 0;
static uint8_t mcu_send_write_data[128];
uint16_t mb_req_mcu_write(uint8_t *send_buf)
{
	uint16_t len = 0;
	adu.id = id_reserve;
	len += sizeof(adu.id);
	adu.pdu.mbfuncode = funcode_mcu_write;
	len += sizeof(adu.pdu.mbfuncode);
	adu.pdu.data.mcu_write.addr = BigLittleSwap16(mcu_send_write_addr);
	len += sizeof(adu.pdu.data.mcu_write.addr);
	adu.pdu.data.mcu_write.len = BigLittleSwap16(mcu_send_write_len);
	len += sizeof(adu.pdu.data.mcu_write.len);
	memcpy(adu.pdu.data.mcu_write.data, mcu_send_write_data, mcu_send_write_len);
	len += mcu_send_write_len;
	adu.crc = crc16((uint8_t *)&adu, len);
	memcpy(send_buf, (uint8_t *)&adu, len);
	send_buf[len] = (uint8_t)(adu.crc);
	len += 1;
	send_buf[len] = (uint8_t)(adu.crc >> 8);
	len += 1;
	return len;
}

uint16_t send_ltc(uint8_t *send_buf)
{
	static uint8_t hour = 0;
	static uint8_t minute = 0;
	static uint8_t second = 0;
	static uint8_t frame = 0;
	
	frame = (frame+1)%24;
	if (0 == frame)
	{
		second = (second+1)%60;
		if (0 == second)
		{
			minute = (minute+1)%60;
			if (0 == minute)
			{
				hour = (hour+1)%24;
			}
		}
	}
	
	mcu_send_write_addr = 0;
	mcu_send_write_len = 4;

//	mcu_send_write_data[0] = hour;
//	mcu_send_write_data[1] = minute;
//	mcu_send_write_data[2] = second;
//	mcu_send_write_data[3] = frame;
	mcu_send_write_data[0] = get_ltc_hour();
	mcu_send_write_data[1] = get_ltc_minute();
	mcu_send_write_data[2] = get_ltc_second();
	mcu_send_write_data[3] = get_ltc_frame();
	
	return mb_req_mcu_write(send_buf);
}
#endif

uint8_t check_crc(uint8_t *adu, uint16_t len)
{
	uint16_t crc16_value;
	if (adu != NULL)
	{
		if (len >= 2)
		{
			crc16_value = (uint16_t)(adu[len - 2] | adu[len - 1] << 8);
			if (crc16_value == crc16(adu, (len - 2)))
			{
				return 1;
			}
		}
	}
	return 0;
}

uint8_t get_address(uint8_t *adu, uint16_t len)
{
	if (adu != NULL)
	{
		if (len > 0)
		{
			return adu[0];
		}
	}
	return 0;
}

uint8_t get_funcode(uint8_t *adu, uint16_t len)
{
	if (adu != NULL)
	{
		if (len > 1)
		{
			return adu[1];
		}
	}
	return 0;
}

uint16_t get_data(uint8_t *adu, uint16_t len, uint8_t *data)
{
	if (adu != NULL)
	{
		if (len > 4)
		{
			memcpy(data, (adu+2), (len - 4));
			return (len - 4);
		}
	}
	return 0;
}

uint32_t get_password(uint8_t *adu, uint16_t len)
{
	uint8_t data[128];
	get_data(adu, len, data);
	return *((uint32_t *)data);
}

uint8_t get_read_ram_cmd(uint8_t *adu, uint16_t len)
{
	uint8_t data[128];
	uint16_t read_addr;
	uint16_t read_len;
	get_data(adu, len, data);
	read_addr = *((uint16_t *)data);
	read_addr = BigLittleSwap16(read_addr);
	read_len = *((uint16_t *)(&data[2]));
	read_len = BigLittleSwap16(read_len);
	mcu_receive_read_ram_addr = read_addr;
	mcu_receive_read_ram_len = read_len;
	return 1;
}

uint8_t get_write_ram_cmd(uint8_t *adu, uint16_t len)
{
	uint8_t data[128];
	uint16_t write_addr;
	uint16_t write_len;
	get_data(adu, len, data);
	write_addr = *((uint16_t *)data);
	write_addr = BigLittleSwap16(write_addr);
	write_len = *((uint16_t *)(&data[2]));
	write_len = BigLittleSwap16(write_len);
	mcu_receive_write_ram_addr = write_addr;
	mcu_receive_write_ram_len = write_len;
	memcpy(&shared_memory_ram[mcu_receive_write_ram_addr], &data[4], mcu_receive_write_ram_len);
	return 1;
}

uint8_t get_read_flash_cmd(uint8_t *adu, uint16_t len)
{
	uint8_t data[128];
	uint16_t read_addr;
	uint16_t read_len;
	get_data(adu, len, data);
	read_addr = *((uint16_t *)data);
	read_addr = BigLittleSwap16(read_addr);
	read_len = *((uint16_t *)(&data[2]));
	read_len = BigLittleSwap16(read_len);
	mcu_receive_read_flash_addr = read_addr;
	mcu_receive_read_flash_len = read_len;
	return 1;
}

uint8_t get_write_flash_cmd(uint8_t *adu, uint16_t len)
{
	uint8_t data[128];
	uint16_t write_addr;
	uint16_t write_len;
	get_data(adu, len, data);
	write_addr = *((uint16_t *)data);
	write_addr = BigLittleSwap16(write_addr);
	write_len = *((uint16_t *)(&data[2]));
	write_len = BigLittleSwap16(write_len);
	mcu_receive_write_flash_addr = write_addr;
	mcu_receive_write_flash_len = write_len;
	user_flash_write(mcu_receive_write_flash_addr+USER_FLASH_APP_DATA_BASE,
                     mcu_receive_write_flash_len,
	                 &data[4]);
	//memcpy(&shared_memory_flash[mcu_receive_write_flash_addr], &data[4], mcu_receive_write_flash_len);
	return 1;
}

uint8_t get_read_info_cmd(uint8_t *adu, uint16_t len)
{
	uint8_t data[128];
	uint8_t read_id;
	uint8_t read_len;
	get_data(adu, len, data);
	read_id = data[0];
	mcu_receive_read_info_id = read_id;
	return 1;
}

uint8_t get_monitor_tick(uint8_t *adu, uint16_t len)
{
	uint8_t data[1] = {0};
	if (adu != NULL)
	{
		if (len == 5)
		{
			get_data(adu, len, data);
			mcu_receive_monitor_tick = data[0];
			return 1;
		}
	}
	return 0;
}

uint16_t mb_rsp_connect(uint8_t *adu, uint16_t len, uint8_t *out)
{	
	uint8_t address;
	uint8_t function_code;
	
	if (check_crc(adu, len) != 0)
	{
		address = get_address(adu, len);
		switch (address)
		{
			case id_reserve:
				function_code = get_funcode(adu, len);
				switch (function_code)
				{
					case funcode_pc_connect:
						if (get_password(adu, len) == BigLittleSwap32(123))
						{
							return mb_rsp_pc_connect(out);
						}
						break;
					default :
						break;
				}
				break;
			default :
				break;
		}
	}
	
