shuqee/shuqee_ltc/shuqee_ltc_stm32f107/shuqee_ltc/Src/modbus_udp.c
	return 0;
}
uint32_t count_udp_ten=0,count_udp_uint=0;

//void ac_overtime_count(void)
//{
//	if(udp_test_can.udp_test_flag)
//	{
//		if((HAL_GetTick()-udp_test_can.count)>=1000)  //超时；
//		{
//			SAFE(udp_test_can.udp_test_flag=0);
//		}
//	}
//}
uint16_t count_led2=0;
uint16_t mb_rsp(uint8_t *adu, uint16_t len, uint8_t *out)
{	
	uint8_t address;
	uint8_t function_code;
	
	if (check_crc(adu, len) != 0)
	{
		address = get_address(adu, len);
		switch (address)
		{
			case id_broadcast:
				function_code = get_funcode(adu, len);
				switch (function_code)
				{					
					case funcode_pc_write_ram:
								////////////////////////////////////////
//					  SAFE( udp_test_can.udp_test_flag=1); //开启CAN计数标志位；
//						udp_test_can.count=HAL_GetTick();  //赋值当前数值；	
//						count_udp_uint++;
//						if(count_udp_uint==0xffffffff)
//						{
//							count_udp_ten++;
//							count_udp_uint=0;
//						}	
//						uart_send_huart2( count_udp_ten,count_udp_uint); 
					
						///////////////////////////
						if (get_write_ram_cmd(adu, len))
						{
						 count_for_485=HAL_GetTick(); 
						  modbus_buscan_task();	
						count_led2++;
						if(count_led2>10)
						{
							count_led2=0;
							LED3_TOGGLE();
						}							
							return 0;
						}
						break;
					default :
						break;
				}
				break;
			case id_reserve:
				function_code = get_funcode(adu, len);
				switch (function_code)
				{
					case funcode_pc_monitor:
						if (get_monitor_tick(adu, len))
						{
							return mb_rsp_pc_monitor(out);
						}
						break;
					case funcode_pc_read_ram:
						if (get_read_ram_cmd(adu, len))
						{
							return mb_rsp_pc_read_ram(out);
						}
						break;
					case funcode_pc_write_ram:
						if (get_write_ram_cmd(adu, len))
						{
							return mb_rsp_pc_write_ram(out);
						}
						break;
					case funcode_pc_read_flash:
						if (get_read_flash_cmd(adu, len))
						{
							return mb_rsp_pc_read_flash(out);
						}
						break;
					case funcode_pc_write_flash:
						if (get_write_flash_cmd(adu, len))
						{
							return mb_rsp_pc_write_flash(out);
						}
						break;
					case funcode_pc_read_info:
						if (get_read_info_cmd(adu, len))
						{
							return mb_rsp_pc_read_info(out);
						}
						break;
					default :
						break;
				}
				break;
			default :
				break;
		}
	}
	
	return 0;
}

enum
{
	FUNCTION_NORMAL = 0,
	FUNCTION_FIRMWARE_UPDATE = 1
};

void modbus_udp_task(void)
{
	static uint8_t flag_first_run = 1;
	if (flag_first_run)
	{
		flag_first_run = 0;
		ram->high[0] = 0;
		ram->high[1] = 0;
		ram->high[2] = 0;
	}
	lcd_high_update(ram->high[0], ram->high[1], ram->high[2]);
}

void modbus_bus485_task(void)
{
	bus485_control(ram->high, ram->sp_seat, ram->sp_env, 0);
}

void modbus_485_overtime(void)
{
	ram->sp_env=0;
	ram->sp_seat=0;
	ram->reserve_0[0]=0;
	ram->reserve_0[1]=0;
}	

void modbus_switch_function_task(void)
{
	if (ram->switch_function == FUNCTION_FIRMWARE_UPDATE)
	{
		boot_set_update_flag();
		HAL_NVIC_SystemReset();
		while(1);
	}
}

void special_display(void)
{
	special_checkout(ram->sp_env);
}	
static uint32_t can_cnt=0;
void modbus_buscan_task(void)
{
	buscan_control(ram->high, ram->sp_seat, ram->sp_env,NULL, 0,ram->reserve_0[0],ram->reserve_0[1]);		
  can_cnt++; 
//  if(udp_test_can.udp_test_flag)
//	{
//		SAFE(udp_test_can.can_count ++);
//	}		
	
}	

void clr_reset_bit(void)
{
	ram->sp_seat&=0xfe;
}	
